use ПРОДАЖИ;
go 
select Заказы.Наименование_товара, Заказы.Дата_поставки, Товары.Цена
from Заказы, Товары
where Заказы.Наименование_товара = Товары.Наименование_товара
and
Заказчик in (select Наименование_фирмы From Заказчики where ( Адрес like 'Минск%'))



select Заказы.Наименование_товара, Заказы.Дата_поставки, Товары.Цена
from Заказы inner join Товары 
on заказы.Наименование_товара = Товары.Наименование_товара
where Заказчик in ( select  Наименование_фирмы from Заказчики where ( Адрес like 'Минск%'))


select Заказы.Наименование_товара, Заказы.Дата_поставки, Товары.Цена
from заказы inner join Товары
on Заказы.Наименование_товара = Товары.Наименование_товара
inner join Заказчики
on Заказчики.Наименование_фирмы = Заказы.Заказчик
where (Адрес like 'Минск%')


select Наименование_товара, Цена_продажи
from Заказы a
where Заказчик = ( select top(1) Заказчик from Заказы aa 
where aa.Наименование_товара = a.Наименование_товара 
order by Цена_продажи desc)


select Наименование_товара from Товары
where not exists ( select *from Заказы 
where Заказы.Наименование_товара = Товары.Наименование_товара)



Select top 1
(select avg(Цена_продажи) from Заказы where Наименование_товара like 'стол') [стол],
(select avg(Цена_продажи) from Заказы where Наименование_товара like 'п') [п]
from Заказы

Select Наименование_товара, Цена_продажи from Заказы 
where Цена_продажи >= all ( select Цена_продажи from Заказы
where Наименование_товара like '1%')

select Наименование_товара, Цена_продажи from Заказы
where Цена_продажи >any ( select Цена_продажи from Заказы 
where Наименование_товара like 'c%')

