use ПРОДАЖИ;
go

 SELECT [Цена_продажи],  
          max(Цена_продажи)  [Максимальная цена],  
          count(*)  [Количество заказанных товаров]
    From  Заказы  Inner Join  Товары 
              On  Заказы.Наименование_товара = Товары.Наименование_товара  
               And  Товары.Количество >5   Group by [Цена_продажи] 
	



select *
from (select case when Цена_продажи between 1 and 50 then 'цена < 50'
	when Цена_продажи between 50 and 100 then 'цена от 50 до 100'
	else 'цена больше 100 ' 
	end [Пределы цен], count(*) [количество]
from Заказы Group by case 
when Цена_продажи between 1 and 50 then 'цена < 50'
when Цена_продажи between 50 and 100 then 'цена от 50 до 100'
else 'цена больше 100'
end) as T
order by case [Пределы цен]
when 'цена < 50' then 3
when 'цена от 50 до 100' then 2
when 'цена больше 100' then 1
else 0
end




select g.Наименование_товара, s.Наименование_фирмы, f.Цена ,
round(avg(cast(g.Цена_продажи as float(4))), 2)
from Товары f inner join Заказы g 
on f.Наименование_товара = g.Наименование_товара
inner join Заказчики s 
on g.Заказчик = s.Наименование_фирмы 
where f.Цена > 50 
group by g.Наименование_товара, s.Наименование_фирмы, f.Цена


select Наименование_товара, Цена_продажи, sum(Количество) 
Количество
From Заказы
Where Наименование_товара in ('1', 'Продукт 3')
group by Наименование_товара, Цена_продажи;

select p1.Наименование_товара, p1.Цена_продажи,
(select count(*) from Заказы p2
where p2.Наименование_товара = p1.Наименование_товара
and p2.Цена_продажи = p1.Цена_продажи) [ количество ] 
from Заказы p1 
group by p1.Наименование_товара, p1.Цена_продажи 
Having Цена_продажи < 50 or Цена_продажи > 100 