use ПРОДАЖИ;
go 
select ТОВАРЫ.Наименование_товара, ТОВАРЫ.Цена, ЗАКАЗЫ.Цена_продажи
from ЗАКАЗЫ Inner Join ТОВАРЫ 
on ЗАКАЗЫ.Наименование_товара  = ТОВАРЫ.Наименование_товара;
go

select ЗАКАЗЫ.Наименование_товара, Товары.Цена, Заказы.Цена_продажи
from Заказы inner join Товары 
on Заказы.Наименование_товара = Товары.Наименование_товара and Заказы.Наименование_товара like '%т%';
go

select Товары.Наименование_товара, Заказы.Дата_поставки,
case 
when ( Заказы.Цена_продажи between 1 and 50) then ' цена < 50 '
when ( Заказы.Цена_продажи between 50 and 100) then ' цена от 50 до 100 '
else ' цена больше 100'
end [пределы цен ]
from Товары inner join Заказы 
on Товары.Наименование_товара = Заказы.Наименование_товара
order by Заказы.Наименование_товара
go

select isnull (Заказы.Наименование_товара, '**') [Товар	],
Товары.Количество
from Товары left Outer Join Заказы 
on Товары.Наименование_товара = Заказы.Наименование_товара
go 

select *from Товары at full Outer Join Заказы aa
on aa.Наименование_товара = at.Наименование_товара 
order by aa.Наименование_товара, at.Наименование_товара
select Count(*) from Товары at full Outer Join Заказы aa 
on aa.Наименование_товара = at.Наименование_товара 
where Номер_заказа is null 
go

select Товары.Наименование_товара, Товары.Цена, Заказы.Номер_заказа
from Заказы Cross Join Товары 
where Заказы.Наименование_товара = Товары.Наименование_товара
go
